БухЭксп/InformationRegisters/CW_ДанныеПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДанныеПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыПервичныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДанныеПервичныхДокументов/Ext/ManagerModule.bsl
Процедура ЗаписатьДанныеПервичногоДокумента(Знач ДанныеДокумента, Знач ВидДокумента, НомерДляПечати, Номер, Дата) Экспорт
	    
	ЗаписьРегистра = РегистрыСведений.CW_ДанныеПервичныхДокументов.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Организация 		= ДанныеДокумента.Организация;
	ЗаписьРегистра.Контрагент 		= ДанныеДокумента.Контрагент;
	ЗаписьРегистра.Документ 		= ДанныеДокумента.Ссылка;
	ЗаписьРегистра.ВидДокумента 	= ВидДокумента;
	ЗаписьРегистра.НомерДляПечати 	= НомерДляПечати;
	ЗаписьРегистра.Номер 			= Номер; 
	ЗаписьРегистра.Дата 			= Дата; 
	ЗаписьРегистра.Записать(Истина);

КонецПроцедуры  

Процедура ОчиститьНаборПоУсловиям(ДанныеДокумента) Экспорт
	
	Набор = РегистрыСведений.CW_ДанныеПервичныхДокументов.СоздатьНаборЗаписей();
	Набор.Отбор.Организация.Установить(ДанныеДокумента.Организация);
	Набор.Отбор.Контрагент.Установить(ДанныеДокумента.Контрагент);
	Набор.Отбор.Документ.Установить(ДанныеДокумента.Ссылка);  
	Набор.Прочитать();
	Набор.Очистить();
	
	
КонецПроцедуры

Процедура ЗаполнитьДанныеРегистра() Экспорт
	
	ДатаДокумента =  КонецДня(ТекущаяДата());
	
	Выборка = ПолучитьВыборкуДокументов(ДатаДокумента);
	
	Пока Истина Цикл   
		
		Если Выборка.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл  
			
			CW_Документы.ЗаписатьДанныеПервичногоДокумента(Выборка.Ссылка);
			
			ДатаДокумента =  Выборка.Дата;
			
		КонецЦикла; 
		
		Выборка = ПолучитьВыборкуДокументов(ДатаДокумента);
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьВыборкуДокументов(ДатаДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1000
	               |	CW_ДоходыПоГрузоперевозке.Ссылка КАК Ссылка,
	               |	CW_ДоходыПоГрузоперевозке.Контрагент КАК Контрагент,
	               |	CW_ДоходыПоГрузоперевозке.Организация КАК Организация,
	               |	CW_ДоходыПоГрузоперевозке.ФормируетсяАкт КАК ФормируетсяАкт,
	               |	CW_ДоходыПоГрузоперевозке.ФормируетсяСчет КАК ФормируетсяСчет,
	               |	CW_ДоходыПоГрузоперевозке.ФормируетсяСчетФактура КАК ФормируетсяСчетФактура,
	               |	CW_ДоходыПоГрузоперевозке.НомерСчета КАК НомерСчета,
	               |	CW_ДоходыПоГрузоперевозке.НомерАкта КАК НомерАкта,
	               |	CW_ДоходыПоГрузоперевозке.НомерСчетаФактуры КАК НомерСчетаФактуры,
	               |	CW_ДоходыПоГрузоперевозке.ДатаАкта КАК ДатаАкта,
	               |	CW_ДоходыПоГрузоперевозке.ДатаСчета КАК ДатаСчета,
	               |	CW_ДоходыПоГрузоперевозке.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	               |	CW_ДоходыПоГрузоперевозке.Дата КАК Дата
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозке.Проведен
	               |	И CW_ДоходыПоГрузоперевозке.Дата < &ДатаДокумента
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_ДоходыПоГрузоперевозке.Дата УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ"; 
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции
